raddanesh/ClockClock-24/firmware/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Selects I2C mode.: Standard GPIO functionality. Requires external pull-up for GPIO output function. */
#define PIO0_10_I2CMODE_Standard_GPIO 0x01u
/*!
 * @brief Selects I2C mode.: Standard GPIO functionality. Requires external pull-up for GPIO output function. */
#define PIO0_11_I2CMODE_Standard_GPIO 0x01u

/*! @name PIO0_16 (number 15), M0_DIR
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITMOTORPINS_M0_DIR_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITMOTORPINS_M0_DIR_GPIO_PIN_MASK (1U << 16U) /*!<@brief GPIO pin mask */
#define BOARD_INITMOTORPINS_M0_DIR_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITMOTORPINS_M0_DIR_PIN 16U                   /*!<@brief PORT pin number */
#define BOARD_INITMOTORPINS_M0_DIR_PIN_MASK (1U << 16U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PIO0_17 (number 48), M0_STEP
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITMOTORPINS_M0_STEP_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITMOTORPINS_M0_STEP_GPIO_PIN_MASK (1U << 17U) /*!<@brief GPIO pin mask */
#define BOARD_INITMOTORPINS_M0_STEP_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITMOTORPINS_M0_STEP_PIN 17U                   /*!<@brief PORT pin number */
#define BOARD_INITMOTORPINS_M0_STEP_PIN_MASK (1U << 17U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PIO0_18 (number 47), M1_DIR
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITMOTORPINS_M1_DIR_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITMOTORPINS_M1_DIR_GPIO_PIN_MASK (1U << 18U) /*!<@brief GPIO pin mask */
#define BOARD_INITMOTORPINS_M1_DIR_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITMOTORPINS_M1_DIR_PIN 18U                   /*!<@brief PORT pin number */
#define BOARD_INITMOTORPINS_M1_DIR_PIN_MASK (1U << 18U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PIO0_19 (number 46), M1_STEP
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITMOTORPINS_M1_STEP_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITMOTORPINS_M1_STEP_GPIO_PIN_MASK (1U << 19U) /*!<@brief GPIO pin mask */
#define BOARD_INITMOTORPINS_M1_STEP_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITMOTORPINS_M1_STEP_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITMOTORPINS_M1_STEP_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PIO0_20 (number 45), M2_DIR
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITMOTORPINS_M2_DIR_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITMOTORPINS_M2_DIR_GPIO_PIN_MASK (1U << 20U) /*!<@brief GPIO pin mask */
#define BOARD_INITMOTORPINS_M2_DIR_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITMOTORPINS_M2_DIR_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_INITMOTORPINS_M2_DIR_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PIO0_21 (number 44), M2_STEP
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITMOTORPINS_M2_STEP_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITMOTORPINS_M2_STEP_GPIO_PIN_MASK (1U << 21U) /*!<@brief GPIO pin mask */
#define BOARD_INITMOTORPINS_M2_STEP_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITMOTORPINS_M2_STEP_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_INITMOTORPINS_M2_STEP_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PIO0_22 (number 43), M3_DIR
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITMOTORPINS_M3_DIR_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITMOTORPINS_M3_DIR_GPIO_PIN_MASK (1U << 22U) /*!<@brief GPIO pin mask */
#define BOARD_INITMOTORPINS_M3_DIR_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITMOTORPINS_M3_DIR_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_INITMOTORPINS_M3_DIR_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PIO0_23 (number 39), M3_STEP
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITMOTORPINS_M3_STEP_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITMOTORPINS_M3_STEP_GPIO_PIN_MASK (1U << 23U) /*!<@brief GPIO pin mask */
#define BOARD_INITMOTORPINS_M3_STEP_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITMOTORPINS_M3_STEP_PIN 23U                   /*!<@brief PORT pin number */
#define BOARD_INITMOTORPINS_M3_STEP_PIN_MASK (1U << 23U)      /*!<@brief PORT pin mask */
                                                              /* @} */

