raddanesh/ClockClock-24/firmware/board/pin_mux.h
/*! @name PIO0_24 (number 20), M4_DIR
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITMOTORPINS_M4_DIR_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITMOTORPINS_M4_DIR_GPIO_PIN_MASK (1U << 24U) /*!<@brief GPIO pin mask */
#define BOARD_INITMOTORPINS_M4_DIR_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITMOTORPINS_M4_DIR_PIN 24U                   /*!<@brief PORT pin number */
#define BOARD_INITMOTORPINS_M4_DIR_PIN_MASK (1U << 24U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PIO0_25 (number 19), M11_STEP
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITMOTORPINS_M4_STEP_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITMOTORPINS_M4_STEP_GPIO_PIN_MASK (1U << 25U) /*!<@brief GPIO pin mask */
#define BOARD_INITMOTORPINS_M4_STEP_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITMOTORPINS_M4_STEP_PIN 25U                   /*!<@brief PORT pin number */
#define BOARD_INITMOTORPINS_M4_STEP_PIN_MASK (1U << 25U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PIO0_26 (number 18), M5_DIR
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITMOTORPINS_M5_DIR_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITMOTORPINS_M5_DIR_GPIO_PIN_MASK (1U << 26U) /*!<@brief GPIO pin mask */
#define BOARD_INITMOTORPINS_M5_DIR_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITMOTORPINS_M5_DIR_PIN 26U                   /*!<@brief PORT pin number */
#define BOARD_INITMOTORPINS_M5_DIR_PIN_MASK (1U << 26U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PIO0_27 (number 17), M5_STEP
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITMOTORPINS_M5_STEP_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITMOTORPINS_M5_STEP_GPIO_PIN_MASK (1U << 27U) /*!<@brief GPIO pin mask */
#define BOARD_INITMOTORPINS_M5_STEP_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITMOTORPINS_M5_STEP_PIN 27U                   /*!<@brief PORT pin number */
#define BOARD_INITMOTORPINS_M5_STEP_PIN_MASK (1U << 27U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PIO0_28 (number 7), M6_DIR
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITMOTORPINS_M6_DIR_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITMOTORPINS_M6_DIR_GPIO_PIN_MASK (1U << 28U) /*!<@brief GPIO pin mask */
#define BOARD_INITMOTORPINS_M6_DIR_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITMOTORPINS_M6_DIR_PIN 28U                   /*!<@brief PORT pin number */
#define BOARD_INITMOTORPINS_M6_DIR_PIN_MASK (1U << 28U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PIO0_29 (number 38), M6_STEP
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITMOTORPINS_M6_STEP_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITMOTORPINS_M6_STEP_GPIO_PIN_MASK (1U << 29U) /*!<@brief GPIO pin mask */
#define BOARD_INITMOTORPINS_M6_STEP_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITMOTORPINS_M6_STEP_PIN 29U                   /*!<@brief PORT pin number */
#define BOARD_INITMOTORPINS_M6_STEP_PIN_MASK (1U << 29U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PIO0_10 (number 13), M7_DIR
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITMOTORPINS_M7_DIR_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITMOTORPINS_M7_DIR_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */
#define BOARD_INITMOTORPINS_M7_DIR_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITMOTORPINS_M7_DIR_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITMOTORPINS_M7_DIR_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PIO0_4 (number 6), M11_DIR
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITMOTORPINS_M11_DIR_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITMOTORPINS_M11_DIR_GPIO_PIN_MASK (1U << 4U) /*!<@brief GPIO pin mask */
#define BOARD_INITMOTORPINS_M11_DIR_PORT 0U                  /*!<@brief PORT device index: 0 */
#define BOARD_INITMOTORPINS_M11_DIR_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITMOTORPINS_M11_DIR_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PIO0_6 (number 34), M10_STEP
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITMOTORPINS_M10_STEP_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITMOTORPINS_M10_STEP_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */
#define BOARD_INITMOTORPINS_M10_STEP_PORT 0U                  /*!<@brief PORT device index: 0 */
#define BOARD_INITMOTORPINS_M10_STEP_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITMOTORPINS_M10_STEP_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PIO0_7 (number 33), M10_DIR
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITMOTORPINS_M10_DIR_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITMOTORPINS_M10_DIR_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */
#define BOARD_INITMOTORPINS_M10_DIR_PORT 0U                  /*!<@brief PORT device index: 0 */
#define BOARD_INITMOTORPINS_M10_DIR_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITMOTORPINS_M10_DIR_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PIO0_15 (number 22), M9_STEP
  @{ */

