raddanesh/ClockClock-24/firmware/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITMOTORPINS_M9_STEP_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITMOTORPINS_M9_STEP_GPIO_PIN_MASK (1U << 15U) /*!<@brief GPIO pin mask */
#define BOARD_INITMOTORPINS_M9_STEP_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITMOTORPINS_M9_STEP_PIN 15U                   /*!<@brief PORT pin number */
#define BOARD_INITMOTORPINS_M9_STEP_PIN_MASK (1U << 15U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PIO0_14 (number 37), M9_DIR
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITMOTORPINS_M9_DIR_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITMOTORPINS_M9_DIR_GPIO_PIN_MASK (1U << 14U) /*!<@brief GPIO pin mask */
#define BOARD_INITMOTORPINS_M9_DIR_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITMOTORPINS_M9_DIR_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITMOTORPINS_M9_DIR_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PIO0_13 (number 2), M8_STEP
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITMOTORPINS_M8_STEP_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITMOTORPINS_M8_STEP_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */
#define BOARD_INITMOTORPINS_M8_STEP_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITMOTORPINS_M8_STEP_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITMOTORPINS_M8_STEP_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PIO0_12 (number 4), M8_DIR
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITMOTORPINS_M8_DIR_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITMOTORPINS_M8_DIR_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */
#define BOARD_INITMOTORPINS_M8_DIR_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITMOTORPINS_M8_DIR_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITMOTORPINS_M8_DIR_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PIO0_11 (number 12), M7_STEP
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITMOTORPINS_M7_STEP_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITMOTORPINS_M7_STEP_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */
#define BOARD_INITMOTORPINS_M7_STEP_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITMOTORPINS_M7_STEP_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITMOTORPINS_M7_STEP_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PIO0_1 (number 24), M11_STEP
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITMOTORPINS_M11_STEP_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITMOTORPINS_M11_STEP_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */
#define BOARD_INITMOTORPINS_M11_STEP_PORT 0U                  /*!<@brief PORT device index: 0 */
#define BOARD_INITMOTORPINS_M11_STEP_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITMOTORPINS_M11_STEP_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name PIO0_0 (number 36), DRV_RESET
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITMOTORPINS_DRV_RESET_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITMOTORPINS_DRV_RESET_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */
#define BOARD_INITMOTORPINS_DRV_RESET_PORT 0U                  /*!<@brief PORT device index: 0 */
#define BOARD_INITMOTORPINS_DRV_RESET_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITMOTORPINS_DRV_RESET_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitMotorPins(void); /* Function assigned for the Cortex-M0P */

/*! @name PIO0_9 (number 25), MAG1
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITMAGPINS_MAG1_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITMAGPINS_MAG1_GPIO_PIN_MASK (1U << 9U) /*!<@brief GPIO pin mask */
#define BOARD_INITMAGPINS_MAG1_PORT 0U                  /*!<@brief PORT device index: 0 */
#define BOARD_INITMAGPINS_MAG1_PIN 9U                   /*!<@brief PORT pin number */
#define BOARD_INITMAGPINS_MAG1_PIN_MASK (1U << 9U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO0_8 (number 26), MAG0
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITMAGPINS_MAG0_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITMAGPINS_MAG0_GPIO_PIN_MASK (1U << 8U) /*!<@brief GPIO pin mask */
#define BOARD_INITMAGPINS_MAG0_PORT 0U                  /*!<@brief PORT device index: 0 */
#define BOARD_INITMAGPINS_MAG0_PIN 8U                   /*!<@brief PORT pin number */
#define BOARD_INITMAGPINS_MAG0_PIN_MASK (1U << 8U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitMagPins(void); /* Function assigned for the Cortex-M0P */

/*! @name PIO1_1 (number 14), RS485_TXRX_EN
  @{ */
#define BOARD_INITRS485_RS485_TXRX_EN_PORT 1U                  /*!<@brief PORT device index: 1 */
#define BOARD_INITRS485_RS485_TXRX_EN_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITRS485_RS485_TXRX_EN_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitRS485(void); /* Function assigned for the Cortex-M0P */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSWD_DEBUGPins(void); /* Function assigned for the Cortex-M0P */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
